app/Models/ModelPekerjaan.php

SELECT *
FROM `tbl_pekerjaan`
ORDER BY `id_pekerjaan` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_pekerjaan')
        ->orderBy('id_pekerjaan', 'ASC')
        ->get()
        ->getResultArray();

INSERT INTO `tbl_pekerjaan` (`pekerjaan`) VALUES (('hff'))
---
    public function insertData($data)
    {
        $this->db->table('tbl_pekerjaan')->insert($data);